import { FC, ReactNode } from "react"

import { BlogHeading } from "@/components/Blog/BlogHeading"
import { BlogImage } from "@/components/Blog/BlogImage"
import { generateMetaData } from "@/utils/generateMetaData"

const metadata = generateMetaData("คำศัพท์เลือกตั้งที่น่าสนใจ 2569", "คำศัพท์เลือกตั้งที่น่าสนใจ 2569", "/blog/words")
export { metadata }

const Page = () => {
  const B: FC<{ children: ReactNode }> = ({ children }) => (
    <>
      <span className="font-medium">{children}</span>
      <br />
    </>
  )
  return (
    <div className="mx-auto w-full max-w-[752px] py-16">
      <BlogHeading namespace={"words"} title={"คำศัพท์เลือกตั้งที่น่าสนใจ 2569"} />
      <BlogImage namespace={"words"} index={1} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (1)"} />
      <p className="mb-4 mt-8 px-4 font-light">
        <B>กกต.</B>
        หมายถึง คณะกรรมการการเลือกตั้ง ซึ่งเป็นองค์กรอิสระ ที่จัดตั้งขึ้นมาเพื่อดูแลการเลือกตั้งของประเทศไทย
        รวมถึงเสริมสร้างความเข้าใจเกี่ยวกับระบอบประชาธิปไตย
        <br />
        <br />
        <B>นิวโหวตเตอร์</B>
        หมายถึง ผู้มีสิทธิออกเสียงเลือกตั้งหน้าใหม่
        คือผู้ที่มีสิทธิออกเสียงตามกฎหมายเป็นครั้งแรกในการเลือกตั้งครั้งดังกล่าว
        <br />
        <br />
        <B>สวิงโหวตเตอร์</B>
        หมายถึง ผู้มีสิทธิออกเสียงเลือกตั้งที่ยังไม่ยึดมั่นพรรคใดพรรคหนึ่งเป็นพิเศษ
        มีโอกาสที่จะเปลี่ยนแปลงการตัดสินใจไปกาเบอร์ใดก็ได้ตลอดเวลา
        <br />
        <br />
        <B>คะแนนนิยม</B>
        หมายถึง ระดับความนิยมและการสนับสนุนจากประชาชนที่มีต่อพรรคการเมือง นักการเมือง หรือรัฐบาล
        ซึ่งมักวัดจากผลเลือกตั้ง หรือโพลของสื่อหรือสถาบันที่น่าเชื่อถือ
      </p>
      <BlogImage namespace={"words"} index={2} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (2)"} />
      <p className="mb-4 mt-8 px-4 font-light">
        <B>ทุนเทา</B>
        หมายถึง นักลงทุน/กลุ่มทุน ที่ถูกสงสัยว่าอาจเกี่ยวข้องหรือรับผลประโยชน์จากธุรกิจผิดกฎหมาย
        ซึ่งมักส่งผลกระทบต่อประชาชนทั่วไป เช่น ทุนเทาแก๊งคอลเซนเตอร์
        <br />
        <br />
        <B>บ้านใหญ่</B>
        หมายถึง กลุ่มคนหรือตระกูลที่มีชื่อเสียงในพื้นที่นั้น ๆ โดยในสื่อ มันพูดถึง &apos;บ้านใหญ่&apos; โดยใช้นามสกุล
        ของนักการเมืองที่มีชื่อเสียงนั้น ๆ
        <br />
        <br />
        <B>เสรีนิยม</B>
        หมายถึง กลุ่มคนที่มีอุดมการณ์ทางเมืองในเรื่อง สิทธิเสรีภาพ ภายใต้กรอบกฎหมาย เป็นหลัก
        <br />
        <br />
        <B>อนุรักษ์นิยม</B>
        หมายถึง กลุ่มคนที่มีอุดมการณ์ทางการเมืองที่สนับสนุนคุณค่าแบบดั้งเดิม เน้นการรักษากฎระเบียบของสังคมเป็นหลัก
      </p>
      <BlogImage namespace={"words"} index={3} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (3)"} />
      <p className="mb-4 mt-8 px-4 font-light">
        <B>แคนดิเดตนายก</B>
        หมายถึง ตัวแทนที่แต่ละพรรคเสนอให้รัฐสภาพิจารณาให้ความเห็นชอบแต่งตั้งเป็นนายกรัฐมนตรี
        โดยจะต้องมีคุณสมบัติตามมาตราที่ 160 ของรัฐธรรมนูญปี 2560
        <br />
        <br />
        <B>บัญชีรายชื่อ (ปาร์ตี้ลิสต์ / Party-list)</B>
        หมายถึง ระบบการเลือกตั้งที่ผู้ออกเสียงสามารถเลือกพรรคการเมืองพรรคใดพรรคหนึ่ง
        ซึ่งแต่ละพรรคจะมีการทำบัญชีรายชื่อแคนดิเดต สส. ไว้ และจะนำคะแนนที่พรรคนั้นได้มาคำนวณจำนวน สส.
        บัญชีรายชื่อของพรรคที่จะได้เข้าสู่สภา
        <br />
        <br />
        <B>ยุบสภา</B>
        หมายถึง การที่นายกรัฐมนตรีประกาศให้สภาผู้แทนราษฎร (สภาของ สส.) ในขณะนั้นสิ้นสุดลงก่อนครบวาระ
        (ส่วนวุฒิสภายังอยู่เหมือนเดิม) ซึ่งจะส่งผลให้คณะรัฐมนตรีทั้งหมดต้องออกจากตำแหน่งด้วย
        และจะทำให้เกิดการจัดการเลือกตั้งทั่วไปครั้งใหม่ตามมา รวมถึงการเลือกตั้งครั้งปัจจุบันในวันที่ 8 กุมภาพันธ์นี้ด้วย
        ซึ่งเกิดจากการที่นายอนุทิน ชาญวีรกูล ประกาศยุบสภา
        <br />
        <br />
        <B>งูเห่า</B>
        หมายถึง สมาชิกผู้แทนราษฎร (สส.) ที่หลังได้รับเลือกตั้ง ไม่ทำงานตามมติหรือแนวทางของพรรคตัวเอง
        โดยมักไปโหวตสนับสนุน หรือย้ายไปพรรคฝ่ายตรงข้าม ทำให้พรรคเดิมเสียเปรียบทางการเมือง
      </p>
      <BlogImage namespace={"words"} index={4} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (4)"} />
      <p className="mb-4 mt-8 px-4 font-light">
        <B>เลือกตั้งนอกเขต</B>
        หมายถึง การที่ผู้มีสิทธิเลือกตั้งไปใช้สิทธิเลือกตั้งในเขตเลือกตั้งที่ไม่ใช่เขตตามทะเบียนบ้านของตน
        โดยลงทะเบียนกับทาง กกต. ไว้ก่อน ตามเงื่อนไขและขั้นตอนที่กฎหมายกำหนด
        <br />
        <br />
        <B>เลือกตั้งล่วงหน้า</B>
        หมายถึง การที่ผู้มีสิทธิเลือกตั้งไปใช้สิทธิเลือกตั้งก่อนวันเลือกตั้งจริง ตามวัน เวลา และสถานที่ที่กำหนดไว้
        เพื่ออำนวยความสะดวกแก่ผู้ที่ไม่สามารถไปเลือกตั้งในวันจริงได้
        <br />
        <br />
        <B>คืนหมาหอน</B>
        หมายถึง คืนก่อนวันเลือกตั้ง ซึ่งเป็นช่วงเวลาสุดท้ายที่พรรคการเมืองและผู้สมัครพยายามหาเสียงหรือเจรจาทางการเมือง
        <br />
        <br />
        <B>บัตรเขย่ง</B>
        หมายถึง การที่จำนวนบัตรเลือกตั้งที่ถูกนับไม่ตรงกับจำนวนผู้มาใช้สิทธิ์ที่คูหาเลือกตั้ง
        ซึ่งมักเป็นกรณีที่มีบัตรลงคะแนนมากเกินจำนวนผู้ที่มีสิทธิ์เลือกตั้งในหน่วยนั้น
      </p>
    </div>
  )
}

export default Page
