import {FC, ReactNode} from "react"

import {BlogHeading} from "@/components/Blog/BlogHeading"
import {BlogImage} from "@/components/Blog/BlogImage"

const Page = () => {

  const B: FC<{children: ReactNode}> = ({children}) => ( <><span className="font-medium">{children}</span><br/></>)
  return <div className="mx-auto w-full max-w-[752px] py-16">
    <BlogHeading namespace={"words"} title={"คำศัพท์เลือกตั้งที่น่าสนใจ"}/>
    <BlogImage namespace={"words"} index={1} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (1)"}/>
    <p className="mt-8 mb-4 px-4 font-light">
      <B>ปาร์ตี้ลิสต์ (Party-list)</B>
      เป็นระบบการเลือกตั้งที่ผู้ออกเสียงสามารถเลือกพรรคการเมืองพรรคใดพรรคหนึ่ง ซึ่งแต่ละพรรคจะมีการทำบัญชีรายชื่อแคนดิเดต ส.ส. ไว้ และจะนำคะแนนที่พรรคนั้นได้มาคำนวณจำนวน ส.ส. บัญชีรายชื่อของพรรคที่จะได้เข้าสู่สภา
      <br/><br/>
      <B>แคนดิเดต</B>
      ผู้สมัครรับเลือกตั้งหรือผู้สมัครเข้าชิงตำแหน่งทางการเมือง เช่น แคนดิเดตนายก
      <br/><br/>
      <B>บัตรเขย่ง</B>
      บัตรที่ผู้ใช้สิทธิ์เลือกตั้งมารับไปแล้ว แต่ไม่นำไปลงคะแนน โดยอาจเกิดจากเหตุกะทันหันต่าง ๆ ทำให้ตัวเลขผู้มาใช้สิทธิกับตัวเลขบัตรที่ถูกใช้ไปไม่ตรงกัน
      <br/><br/>
      <B>กาสองใบ/เลือกคนที่รักเลือกพรรคที่ชอบ</B> ในการเลือกตั้งต้องกาบัตรสองใบ ได้แก่ 1) เลือกคนที่รัก คือ เลือกผู้สมัคร ส.ส. หนึ่งคนสำหรับเขตของตัวเอง และ 2) เลือกพรรคที่ชอบ คือ เลือกพรรคการเมืองที่ตัวเองต้องการ ซึ่งจะเป็นการตัดสินจำนวน ส.ส. บัญชีรายชื่อ หรือปาร์ตี้ลิสต์ของพรรคนั้น ๆ ที่จะได้เข้าสู่สภา
    </p>
    <BlogImage namespace={"words"} index={2} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (2)"}/>
    <p className="mt-8 mb-4 px-4 font-light">
      <B>แลนด์สไลด์</B>
      มาจากคำว่า Landslide ที่แปลว่าแผ่นดินถล่ม หมายถึงการชนะการเลือกตั้งอย่างถล่มทลาย หรือการชนะด้วยคะแนนเสียงเกินครึ่ง สามารถจัดตั้งรัฐบาลได้ด้วยพรรคตัวเองพรรคเดียว
      <br/><br/>
      <B>สว. 250</B>
      บทเฉพาะกาลของรัฐธรรมนูญ 2560 กำหนดให้มี ‘วุฒิสภาตามบทเฉพาะกาล 250 คน’ มีอายุ 5 ปี นับจากวันที่มีพระบรมราชโองการแต่งตั้ง ซึ่งเป็นการแต่งตั้งตามที่คณะรักษาความสงบแห่งชาติ (คสช.) เสนอ
      <br/><br/>
      ส.ว. 250 คนนี้ มีอำนาจในการออกเสียงเลือกนายกรัฐมนตรี และยังเหลือวาระการดำรงตำแหน่งอยู่ ทำให้สามารถโหวตเลือกนายกรัฐมนตรีได้อีกครั้งสำหรับการเลือกตั้งใหญ่ในปี 2566 นี้
      <br/><br/>
      <B>แคนดิเดตนายก</B>
      ตัวแทนที่แต่ละพรรคเสนอให้รัฐสภาพิจารณาให้ความเห็นชอบแต่งตั้งเป็นนายกรัฐมนตรี โดยจะต้องมีคุณสมบัติตามมาตราที่ 160 ของรัฐธรรมนูญปี 2560
      <br/><br/>
      <B>นายกฯ คนนอก</B>
      ในอดีตนายกรัฐมนตรีต้องมีที่มาจากการลงสมัครรับเลือกตั้งเป็น ส.ส. ก่อน เพื่อสะท้อนเสียงของประชาชนและแสดงให้เห็นถึงความยึดโยงกับประชาชนตามหลักการของระบอบประชาธิปไตยแบบรัฐสภา ในที่นี้ นายกฯ คนนอกจึงหมายถึง นายกฯ ที่ไม่ได้มาจากการเลือกตั้งของประชาชน หรือก็คือไม่ได้เป็นสมาชิกรัฐสภานั่นเอง แต่รัฐธรรมนูญ 2560 อนุญาตให้พรรคการเมืองเสนอบัญชีรายชื่อแคนดิเดตนายกฯ ที่ไม่จำเป็นต้องเป็น ส.ส. เอาไว้ก่อนการเลือกตั้งได้ ปัจจุบันจึงยังเป็นที่ถกเถียงกันอยู่ว่า แคนดิเดตนายกรัฐมนตรีควรจะต้องมีที่มาจาก ส.ส. หรือไม่
    </p>
    <BlogImage namespace={"words"} index={3} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (3)"}/>
    <p className="mt-8 mb-4 px-4 font-light">
      <B>การเมืองสองขั้ว</B>
      การเมืองที่แบ่งออกเป็น 2 ฝั่งที่อยู่ตรงข้ามกันอย่างชัดเจน ซึ่งอาจมีผลให้ไม่สามารถประนีประนอมหรือตกลงร่วมมือกันได้
      <br/><br/>
      <B>3 ป.</B>
      ประกอบไปด้วย พลเอกประวิตร วงษ์สุวรรณ (บิ๊กป้อม) พลเอกอนุพงษ์ เผ่าจินดา (บิ๊กป๊อก) และพลเอกประยุทธ์ จันทร์โอชา (บิ๊กตู่) เรียงตามลำดับอาวุโส เป็นกลุ่มทหารที่ขึ้นมามีอำนาจทางการเมืองหลังการทำรัฐประหารในปี 2557
      <br/><br/>
      <B>นิวโหวตเตอร์</B>
      ผู้มีสิทธิออกเสียงเลือกตั้งหน้าใหม่ คือผู้ที่มีอายุครบ 18 ปีเมื่อถึงวันเลือกตั้ง และมีสิทธิออกเสียงตามกฎหมายเป็นครั้งแรกในการเลือกตั้งครั้งดังกล่าว
      <br/><br/>
      <B>สวิงโหวตเตอร์</B>
      ผู้มีสิทธิออกเสียงเลือกตั้งที่ไม่ได้ยึดมั่นศรัทธาในนักการเมืองคนใดคนหนึ่งหรือพรรคใดพรรคหนึ่งเป็นพิเศษ มีโอกาสที่จะเปลี่ยนแปลงการตัดสินใจไปกาเบอร์ใดก็ได้ตลอดเวลา
    </p>
    <BlogImage namespace={"words"} index={4} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (4)"}/>
    <p className="mt-8 mb-4 px-4 font-light">
      <B>FPTP</B>
      ย่อมาจาก first past the post คือระบบการเลือกตั้งที่ใช้ในการเลือกตั้งแบบเขต ผู้ที่ได้คะแนนสูงสุดในแต่ละเขตชนะเลือกตั้ง
      <br/><br/>
      <B>เสียงตกน้ำ</B>
      ในระบบ FPTP จะมีผู้ชนะเพียงแค่คนเดียวต่อเขตเลือกตั้ง เสียงของผู้ที่ได้คะแนนลำดับถัด ๆ มาจะไม่ได้รับการพิจารณาเลย จึงเรียกเสียงของผู้สนับสนุนของนักการเมืองที่ได้อันดับรองลงมาว่า เสียงตกน้ำ
      เช่น ถ้าผู้สมัครจากพรรคแอปเปิลชนะเลือกตั้ง เสียงของผู้สนับสนุนพรรคมะละ พรรคกล้วย และพรรคส้มจะตกน้ำไปเลย
      <br/><br/>
      <B>ตัดคะแนน</B>
      หมายถึง การที่ประชาชนลงคะแนนให้พรรคการเมืองหลายพรรคในขั้วการเมืองเดียวกัน จนเสียงกระจัดกระจายและแพ้พรรคฝั่งตรงข้ามในที่สุด อย่างนี้ เรียกว่าตัดคะแนนกันเอง
      <br/><br/>
      เช่น พรรคมะนาว และพรรคมะม่วง เป็นพรรคฝั่งประชาธิปไตย มีผู้สนับสนุนรวมกัน 1400 คน
      พรรคชะเอม และพรรคชะอม เป็นฝั่งเผด็จการ มีผู้สนับสนุนรวมกัน 1000 คน
      พรรคมะนาวได้ 800 เสียง พรรคมะม่วงได้ 600 เสียง พรรคชะเอมได้ 900 เสียง พรรคชะอมได้ 100 เสียง
      <br/><br/>
      พรรคชะเอม จากฝั่งเผด็จการจะชนะเลือกตั้ง เพราะได้คะแนนสูงสุด ทั้ง ๆ ที่พรรคมะนาว และพรรคมะม่วง จากฝั่งประชาธิปไตยมีผู้สนับสนุนรวมกันมากกว่า
      อย่างนี้ เรียกว่า พรรคมะนาว และพรรคมะม่วงตัดคะแนนกันเอง
    </p>
    <BlogImage namespace={"words"} index={5} description={"คำศัพท์เลือกตั้งที่น่าสนใจ (5)"}/>
    <p className="mt-8 mb-4 px-4 font-light">
      <B>Strategic vote</B>
      หมายถึง การโหวตอย่างมียุทธศาสตร์ ซึ่งจะใช้เฉพาะกับบัตรม่วง ที่ใช้เลือก ส.ส. แบบแบ่งเขตเท่านั้น คือ การเทคะแนนเสียงไปให้พรรคฝั่งประชาธิปไตยที่มีโอกาสชนะเลือกตั้งมากที่สุด เพื่อไม่ให้คะแนนเสียงตัดกันเอง และไม่ให้เสียงของเราตกน้ำ
      <br/><br/>
      การโหวตแบบยุทธศาสตร์ไม่จำเป็นต้องเทคะแนนให้พรรคใดพรรคหนึ่งในทุก ๆ เขตเหมือนกัน แต่ต้องเช็คจากผลการเลือกตั้งตอนปี 62 ผลการเลือกตั้งท้องถิ่น และโพลที่ออกมา เพื่อให้เสียงของฝั่งประชาธิปไตยรวมกัน ชนะฝั่งเผด็จการ และได้ ส.ส. มาใช้อำนาจรัฐในการเปลี่ยนกฎ กติกา แก้ไขรัฐธรรมนูญให้กลับมาสู่ระบอบประชาธิปไตยแบบสากล เพื่อเริ่มก้าวแรกของการฟื้นฟูประชาธิปไตยไทย
      <br/><br/>
      ทั้งนี้ การเลือกเพื่อแสดงอุดมการณ์ และแสดงออกถึงความหวังความฝัน สามารถโหวตในบัตรเขียว เลือก ส.ส. ปาร์ตี้ลิสต์ได้ เพราะเสียงในบัตรเขียวปาร์ตี้ลิสต์จะไม่มีทางตกน้ำ
    </p>
  </div>
}

export default Page