import { BlogHeading } from "@/components/Blog/BlogHeading"
import { BlogImage } from "@/components/Blog/BlogImage"
import { generateMetaData } from "@/utils/generateMetaData"

const metaData = generateMetaData("การเลือกนายกรัฐมนตรี", "การเลือกนายกรัฐมนตรี", "/blog/priminister")
export { metaData }

const Page = () => {
  return (
    <div className="mx-auto w-full max-w-[752px] py-16">
      <BlogHeading namespace={"priminister"} title={"การเลือกนายกรัฐมนตรี"} />
      <BlogImage namespace={"priminister"} index={1} description={"การเลือกนายกรัฐมนตรี"} />
      <p className="mt-8 mb-4 px-4 font-light">
        ในการเลือกตั้งนี้ นายกรัฐมนตรีต้องได้รับเสียงสนับสนุนเกินครึ่งหนึ่งของทั้ง ส.ส. และ ส.ว. เพื่อตั้งรัฐบาล
        ในรัฐสภามี ส.ส. 500 คน และ ส.ว. 250 คน ดังนั้น นายกรัฐมนตรีต้องได้รับเสียงสนับสนุน 376 เสียง
        <br />
        <br />
        นั่นหมายความว่า แม้จะรวมเสียงได้ 250 เสียง ซึ่งเกินครึ่งหนึ่งของ ส.ส. ที่มาจากการเลือกตั้งแล้ว
        ก็ยังไม่สามารถเลือกนายก และตั้งรัฐบาลได้ โดยต้องหาเสียงสนับสนุนอีก 125 เสียง เพื่อให้ถึงครึ่งหนึ่งของรัฐสภา
        ซึ่งอาจจะมาจาก ส.ส. จากพรรคต่าง ๆ หรือมาจาก ส.ว. ที่มาจากการแต่งตั้งก็ได้
        <br />
        <br />
        ทั้งนี้ในการเลือกตั้งปี 2562 ส.ว. ทุกคนลงเสียงให้ประยุทธ์ จันทร์โอชาเป็นนายกรัฐมนตรี
        เว้นแต่ประธานวุฒิสภาที่งดออกเสียง นี่แสดงให้เห็นถึงจุดยืนทางการเมืองที่ชัดเจน
        นั่นคือการสนับสนุนการสืบทอดอำนาจของฝั่งเผด็จการ
        <br />
        <br />
        ดังนั้น ส.ว. ที่มาจากการแต่งตั้งของเผด็จการจึงมีบทบาทสำคัญมากในการจัดตั้งรัฐบาล
        โดยเฉพาะในกรณีที่พรรคใหญ่ของฝั่งประชาธิปไตยชนะการเลือกตั้ง แต่ไม่สามารถรวมเสียงให้ถึง 376 เสียงได้
        สถานการณ์เช่นนี้จะทำให้พรรคเล็กที่ต้องการเป็นเฉพาะรัฐบาลอยากไปร่วมจัดตั้งรัฐบาลกับพรรคเผด็จการมากกว่า
        เพราะมีเสียงของ ส.ว. รองรับอยู่แล้ว แทนที่จะจับกับพรรคฝั่งประชาธิปไตย
      </p>
    </div>
  )
}

export default Page
