import { InfoTemplate } from "@/components/Info/InfoTemplate"
import { generateMetaData } from "@/utils/generateMetaData"

const metadata = generateMetaData("ข้อห้ามที่ควรรู้", "ข้อห้ามที่ควรรู้", "/info/prohibition")
export { metadata }

const Page = () => {
  const H = InfoTemplate.Highlight
  return (
    <InfoTemplate namespace={"prohibition"} title={"ข้อห้ามที่ควรรู้"} primeImgDescription={"ข้อห้ามที่ควรรู้"}>
      <InfoTemplate.Bold>ข้อห้ามต้องรู้ !</InfoTemplate.Bold>
      <ol className="list-inside list-decimal pl-2">
        <li>
          ห้ามจงใจ<H>ทำบัตรเลือกตั้งชำรุด</H> หรือทำให้เป็น<H>บัตรเสีย</H>
        </li>
        <li>
          ห้ามนำบัตรเลือกตั้ง<H>ออกไปจากที่เลือกตั้ง</H> *เว้นแต่กระทำตามหน้าที่และอำนาจ*
        </li>
        <li>
          ห้าม<H>พนัน</H>เกี่ยวกับผลการเลือกตั้ง
        </li>
        <li>
          ห้ามหาเสียง<H>เกินกำหนดเวลา</H> นับตั้งแต่ 18.00 น. ของวันก่อนวันเลือกตั้งหนึ่งวัน จนสิ้นสุดวันเลือกตั้ง (เช่น
          หากวันเลือกตั้งคือวันที่ 14 พฤษภาคม การหาเสียงจะไม่สามารถทำได้หลัง 18.00 น. ของวันที่ 13 พฤษภาคม
          ไปจนถึงสิ้นสุดวันที่ 14 พฤษภาคม)
        </li>
        <li>
          ห้าม<H>จำหน่ายหรือจัดเลี้ยงสุรา</H>ทุกชนิด
        </li>
        <li>
          ห้ามไม่ให้ผู้ที่รู้อยู่แล้วว่าตน<H>ไม่มีสิทธิ์เลือกตั้ง ลงคะแนน</H>หรือพยายามลงคะแนนเสียง
        </li>
        <li>
          ห้าม<H>ผู้ที่ไม่มีสัญชาติไทย เข้ามามีส่วนช่วย</H>ในการเลือกตั้ง
        </li>
        <li>
          ห้าม<H>ถ่ายภาพบัตรเลือกตั้ง</H> โดยมีเจตนาให้เห็นเครื่องหมายลงคะแนนในคูหา
        </li>
        <li>
          ห้าม<H>ซื้อ-ขายเสียง</H> เรียก หรือรับเงิน ทรัพย์สินหรือผลประโยชน์อื่นใดสำหรับตนเองหรือผู้อื่น
          เพื่อลงคะแนนเลือกหรือไม่เลือกผู้สมัครใด
        </li>
        <li>
          ห้าม<H>โกหก</H> ทำการอันเป็นเท็จหรือแกล้งเพื่อให้ผู้สมัครถูกเพิกถอนสิทธิเลือกตั้ง หรือสิทธิสมัครรับเลือกตั้ง
        </li>
        <li>
          ห้ามจงใจ<H>ทำเครื่องหมายอื่นหรือข้อความอื่นไว้ที่บัตรเลือกตั้งนอกเหนือจากเครื่องหมายลงคะแนนเสียง</H>
        </li>
      </ol>
    </InfoTemplate>
  )
}

export default Page
