import { InfoTemplate } from "@/components/Info/InfoTemplate"
import { generateMetaData } from "@/utils/generateMetaData"

const metadata = generateMetaData("เซ็นชื่อตอนเลือกตั้ง", "เซ็นชื่อตอนเลือกตั้ง", "/info/signing")
export { metadata }

const Page = () => {
  const { Bold, Highlight, Link } = InfoTemplate
  return (
    <InfoTemplate namespace={"signing"} title={"เซ็นชื่อตอนเลือกตั้ง"} primeImgDescription={"เซ็นชื่อตอนเลือกตั้ง"}>
      <Bold>ความสำคัญของการเซ็นชื่อ</Bold> : ป้องกันการสวมสิทธิ์
      <br />
      <br />
      <Bold>การเซ็นชื่อเมื่อไปเลือกตั้ง ?</Bold>
      <ol>
        <li>
          1. <Highlight>ตรวจสอบรายชื่อตัวเองและหน่วยเลือกตั้ง</Highlight> (กกต.
          จะส่งเอกสารแจ้งรายชื่อผู้มีสิทธิไปยังเจ้าบ้านตามทะเบียนบ้านไม่เกิน 20 วัน ก่อนวันเลือกตั้ง
          หรือสามารถตรวจสอบรายชื่อได้ในเว็บไซต์ <Link>https://boraservices.bora.dopa.go.th/election/enqelection/</Link>{" "}
          )
        </li>
        <br />
        <li>
          2. เมื่อ️เดินทางไปถึงบริเวณสถานที่เลือกตั้งให้ <Highlight>ตรวจสอบบัญชีรายชื่อและจดจำลำดับที่ของตน</Highlight>{" "}
          ในบัญชีรายชื่อฯ ไว้ (ลำดับที่อาจต่างไปจากจดหมายที่สำนักทะเบียนท้องถิ่นส่งไปยังเจ้าบ้านแต่ละหลัง
          เนื่องจากอาจมีการเพิ่ม - ถอนรายชื่อผู้มีสิทธิเลือกตั้ง)
        </li>
        <br />
        <li>
          ***หากพบว่า รายชื่อตัวเองตกหล่นจากบัญชี ผู้มีสิทธิเลือกตั้ง ผู้มีสิทธิ หรือเจ้าบ้านสามารถนำสำเนาทะเบียนบ้าน
          และบัตรประชาชน หรือบัตรประจำตัวอื่นที่ทางราชการออกให้ไปแจ้งได้ที่หน่วยทะเบียนราษฎร (หน่วยออกบัตรประชาชน)
          สำนักงานเขต หรือที่ว่าการอำเภอ โดยแจ้งก่อนวันเลือกตั้งไม่น้อยกว่า 10 วัน
        </li>
        <br />
        <li>
          ***กรณีพบว่ามีชื่อคนอื่นมาอยู่ในทะเบียนบ้านตัวเอง หรือชื่อตัวเองไปอยู่ในทะเบียนบ้านคนอื่น
          ให้ผู้มีสิทธิเลือกตั้งหรือเจ้าบ้านยื่นคำร้องขอถอดถอนรายชื่อที่เกินมานั้น ก่อนวันเลือกตั้งไม่น้อยกว่า 10 วัน
          โดยนำทะเบียนบ้านไปเป็นหลักฐานด้วย
        </li>
        <br />
        <li>
          3. <Highlight>ยื่นหลักฐานแสดงตนต่อ</Highlight>เจ้าพนักงานเลือกตั้ง เช่น บัตรประชาชน (บัตรฯ หมดอายุก็ใช้ได้)
          หรือบัตรหรือหลักฐานที่ราชการหรือหน่วยงานของรัฐออกให้ โดยต้องมีรูปถ่ายและเลขประจำตัวประชาชน
        </li>
        <br />
        <li>
          4. <Highlight>รับบัตรเลือกตั้ง</Highlight> โดยลงลายมือชื่อ
          หรือพิมพ์ลายนิ้วหัวแม่มือขวาบนต้นขั้วบัตรเลือกตั้งพร้อมรับบัตรเลือกตั้ง !
        </li>
      </ol>
    </InfoTemplate>
  )
}

export default Page
