import { InfoTemplate } from "@/components/Info/InfoTemplate"
import { generateMetaData } from "@/utils/generateMetaData"

const metaData = generateMetaData("การนับคะแนน", "การนับคะแนน", "/info/counting")
export { metaData }

const Counting = () => {
  return (
    <InfoTemplate namespace={"counting"} title={"การนับคะแนน"} primeImgDescription={"การนับคะแนน"}>
      <InfoTemplate.Bold>หลังปิดหน่วยเลือกตั้ง บัตรเราไปไหน -บัตรเลือกตั้งเข้าสู่กระบวนการ นับคะแนน!</InfoTemplate.Bold>
      <br />
      หลังจากลงคะแนน ให้คณะกรรมการประจําหน่วยเลือกตั้งเปิดหีบบัตรเลือกตั้งต่อหน้าประชาชนที่อยู่ ณ สถานที่เลือกตั้ง
      แล้วเริ่มนับคะแนน
      <br />
      <br />
      การนับคะแนนต้องทําที่สถานที่เลือกตั้งโดยเปิดเผย ทำติดต่อกันจนเสร็จสิ้น และห้ามเลื่อนหรือถ่วงเวลาการนับคะแนน
      <br />
      <br />
      ตรวจบัตรเสีย โดยบัตรเลือกตั้งที่มีลักษณะแบบนี้ นับเป็นบัตรเสีย (ห้ามนับเป็นคะแนน) <br />
      <ol>
        <li>(1) บัตรปลอม</li>
        <li>
          (2) บัตรที่มีการทําเครื่องหมาย โดยมีจุดประสงค์ให้เป็นที่สังเกตหรือเขียนข้อความใด ๆ
          ลงในบัตรเลือกตั้งนอกเหนือไปจากเครื่องหมายในการลงคะแนน ยกเว้นเป็นการกระทําโดยชอบด้วยกฎหมาย
          ของเจ้าพนักงานผู้ดําเนินการเลือกตั้ง
        </li>
        <li>(3) บัตรที่ไม่ได้ทําเครื่องหมายลงคะแนน</li>
        <li>(4) บัตรที่ลงคะแนนให้ผู้สมัครมากกว่าหนึ่งคน</li>
        <li>(5) บัตรที่ไม่สามารถรู้ได้ว่าลงคะแนนให้ผู้สมัครคนใด ยกเว้นเป็นการลงคะแนน “ไม่เลือกผู้สมัครผู้ใด”</li>
        <li>
          (6) บัตรที่มีเครื่องหมายลงคะแนนให้ผู้สมัคร แต่ก็มีเครื่องหมายในช่องทําเครื่องหมาย “ไม่เลือกผู้สมัครผู้ใด”
        </li>
        <li>(7) บัตรที่พระราชบัญญัติประกอบรัฐธรรมนูญนี้กําหนดให้เป็นบัตรเสีย</li>
        <li>(8) บัตรที่มีลักษณะตามที่คณะกรรมการกําหนดว่าเป็นบัตรเสีย</li>
      </ol>
      <br />
      <InfoTemplate.Bold>
        ร่วมกันเป็นตาวิเศษ - จับตาดูคณะกรรมการประจำหน่วยเลือกตั้ง ทำแบบนี้ผิดกฎหมาย !!!!
      </InfoTemplate.Bold>
      <ul className="list-disc pl-8">
        <li>จงใจนับบัตรเลือกตั้งหรือคะแนนให้ผิดไปจากความจริงหรือรวมคะแนนให้ผิดไป</li>
        <li>กรรมการประจําหน่วยเลือกตั้งทำบัตรเลือกตั้งชำรุดหรือทำให้เป็นบัตรเสียหากไม่มีอำนาจกระทำโดยชอบด้วยกฎหมาย</li>
        <li>ทำให้บัตรเสียกลายมาเป็นบัตรที่ใช้ได้</li>
        <li>อ่านบัตรเลือกตั้งให้ผิดไปจากความจริง</li>
        <li>ทํารายงานการเลือกต้ังที่ไม่ตรงกับความเป็นจริง</li>
      </ul>
      <br />
      <InfoTemplate.Bold>หลังนับคะแนนเสร็จสิ้น….</InfoTemplate.Bold>
      <ul className="list-disc pl-8">
        <li>
          คณะกรรมการประจําหน่วยเลือกตั้งประกาศผลการนับคะแนนของหน่วยเลือกตั้งนั้น จํานวนบัตรเลือกตั้งที่ใช้
          และจํานวนบัตรเลือกตั้งที่เหลือจากการออกเสียงลงคะแนน และให้คณะกรรมการประจําหน่วยเลือกตั้งทําแบบเปิดเผย
          และรายงานผลการนับคะแนนต่อคณะกรรมการการเลือกตั้งประจําเขตเลือกตั้งโดยเร็ว
        </li>
        <br />
        <li>
          เพื่อความรวดเร็วในการแจ้งข้อมูลการเลือกตั้งต่อประชาชน
          คณะกรรมการสามารถให้มีการรายงานผลการนับคะแนนอย่างไม่เป็นทางการได้
        </li>
        <br />
        <li>
          หากผลการนับคะแนนแสดงให้เห็นว่าจํานวนผู้มาใช้สิทธิเลือกตั้งไม่ตรงกับจํานวนบัตรเลือกตั้งที่ใช้ออกเสียงลงคะแนน
          ให้คณะกรรมการประจําหน่วยเลือกตั้งตรวจสอบความถูกต้อง หากยังไม่ตรงกันอีก
          ให้รายงานสถานการณ์ต่อคณะกรรมการพร้อมเหตุผล
          เพื่อพิจารณาสั่งให้มีการนับคะแนนใหม่หรือสั่งให้ออกเสียงลงคะแนนใหม่ในหน่วยเลือกตั้งนั้น
          พร้อมทั้งแจ้งให้คณะกรรมการการเลือกตั้งประจําเขตเลือกตั้งทราบ
          และนําส่งหีบบัตรเลือกตั้งพร้อมวัสดุอุปกรณ์การเลือกตั้งให้แก่คณะกรรมการการเลือกตั้งประจําเขตเลือกตั้งหรือผู้ที่คณะกรรมการการเลือกตั้งประจําเขตเลือกตั้งมอบหมาย
        </li>
        <br />
        <li>
          เมื่อรวบรวมผลการนับคะแนนทุกหน่วยเลือกตั้งในเขตเลือกตั้งนั้น
          รวมทั้งคะแนนที่ได้จากการออกเสียงลงคะแนนก่อนวันเลือกตั้งและคะแนนที่ได้จากการลงคะแนนเลือกตั้งนอกราชอาณาจักรแล้ว
          ให้คณะกรรมการการเลือกตั้งประจําเขตเลือกตั้งประกาศผลการนับคะแนนผู้สมัครแบบแบ่งเขตเลือกตั้ง
          และคะแนนที่ไม่เลือกผู้สมัครผู้ใด
          แล้วรายงานผลการนับคะแนนต่อผู้อํานวยการการเลือกตั้งประจําจังหวัดและคณะกรรมการโดยเร็ว
          (ตามพระราชบัญญัติประกอบรัฐธรรมนูญว่าด้วยการเลือกตั้งสมาชิกสภาผู้แทนราษฎร มาตรา 123)
        </li>
        <br />
        <li>
          เมื่อคณะกรรมการได้รับรายงานผลการนับคะแนนแล้ว
          ถ้าปรากฏหลักฐานที่สามารถเชื่อได้ว่าการเลือกตั้งในเขตเลือกตั้งใดไม่ได้เป็นไปโดยสุจริตหรือเที่ยงธรรม
          หรือการนับคะแนนเป็นไปโดยไม่ถูกต้อง คณะกรรมการสามารถงดการประกาศผลการเลือกตั้ง
          และจัดให้มีการเลือกตั้งใหม่หรือนับคะแนนใหม่ในหน่วยเลือกตั้งใดหน่วยเลือกตั้งหนึ่งหรือทุกหน่วยเลือกตั้งในเขตเลือกตั้งนั้นก็ได้
          (ตามพระราชบัญญัติประกอบรัฐธรรมนูญว่าด้วยการเลือกตั้งสมาชิกสภาผู้แทนราษฎร มาตรา 124)
        </li>
      </ul>
    </InfoTemplate>
  )
}

export default Counting
